Revit 2024 API
IFCData.SetTypeList Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetTypeList(
	IList<string> typeList
)
Visual Basic
Public Sub SetTypeList ( _
	typeList As IList(Of String) _
)
Visual C++
public:
void SetTypeList(
	IList<String^>^ typeList
)
Parameters
typeList
Type: System.Collections.Generic.IList<String>
See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace